---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AdditionalElementsRequiredRemove
source: html/4934b26b-9947-c560-e23d-4c4777ed480a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AdditionalElementsRequiredRemove Property

To be able to remove the selected elements from the group the following additional element(s) will also be removed: [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId AdditionalElementsRequiredRemove { get; }
```